## Working with Missing Data in Pandas

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

### Filling missing values using fillna(), replace() and interpolate()

In [2]:
data = {'names': ['Steve', 'mary', 'joseph', 'Gabriel'],
        'age': [10, 20, 30, 40],
        'gender': ['male', 'female', 'male', 'male'],
        'rank': [2,5,1,3]
    }

ranking_df = DataFrame(data)
ranking_df.iloc[2:5, 1] = np.nan
ranking_df.iloc[2:1, 1] = np.nan
#set all columns to nan
ranking_df.iloc[3,:] = np.nan

ranking_df

    names   age  gender  rank
0   Steve  10.0    male   2.0
1    mary  20.0  female   5.0
2  joseph   NaN    male   1.0
3     NaN   NaN     NaN   NaN